# Pandas

In [6]:
import pandas as pd

# Key structures in Pandas
1. Series - a labelled array while a list was a unlabelled array - 1 dimensional
2. DataFrame - 2 dimensional ( as a table)

In [7]:
s = pd.Series([1,2,3,4,5])

In [8]:
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [13]:
s1= pd.Series(['sahil','ravikant','ankit','rahul','ajay'], index=['a','b','c','d','e'])

In [14]:
s1

a       sahil
b    ravikant
c       ankit
d       rahul
e        ajay
dtype: object

### By default series index start from 0 and go on like 0,1,2,3

### Data frames are two dimesnion data strucutres

in data frames we pass a dictornary where key values pair are key is column name and value as a list for the column

In [24]:
df = pd.DataFrame({"names":["Sahil","Ajay","Ravikant"] , "marks":[100,53,87],"age":[22,23,25]})

In [25]:
df

      names  marks  age
0     Sahil    100   22
1      Ajay     53   23
2  Ravikant     87   25

In [26]:
df1= pd.read_csv('data/iris.csv')

In [27]:
df1

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

this data set is like we use sepal length and width, petal length and width to predict species

In [28]:
df1.head() # gives 1st five values

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [29]:
df1.tail() # last 5 values

     sepal_length  sepal_width  petal_length  petal_width    species
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

In [32]:
df1.describe()

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.054000      3.758667     1.198667
std        0.828066     0.433594      1.764420     0.763161
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

## Info about these

only works on columns with numeric data or we can run for a particular column if we want

1. count: The number of non-null entries in that column. It tells you how many data points were considered in the calculation of the statistics.
2. mean: The average value of the entries in that column. It's calculated by summing all the values and dividing by the count.
3. std: The standard deviation, which measures the amount of variation or dispersion of the values in the column. A low standard deviation means that the values tend to be close to the mean, while a high standard deviation indicates that the values are spread out over a wider range.
4. min: The minimum value in the column. This is the smallest entry among the data points.
5. max: The maximum value in the column. This is the largest entry among the data points.
6. 25% :- the value tells that 25% of data is less than that value
7. 50% :- the value tells 50% of data is less than that value
8. 75% :- the value tells 75% of data is less than that value

In [31]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   sepal_length  150 non-null    float64
 1   sepal_width   150 non-null    float64
 2   petal_length  150 non-null    float64
 3   petal_width   150 non-null    float64
 4   species       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB

# Data Selection

In [36]:
df1["species"] # gives particular column so that we can operate on that

0         setosa
1         setosa
2         setosa
3         setosa
4         setosa
         ...
145    virginica
146    virginica
147    virginica
148    virginica
149    virginica
Name: species, Length: 150, dtype: object

In [39]:
type(df1["species"]) # series because a column is a 1d and 1d in pandas is series

pandas.core.series.Series

In [41]:
df1[["sepal_length","sepal_width"]] # get two columns

     sepal_length  sepal_width
0             5.1          3.5
1             4.9          3.0
2             4.7          3.2
3             4.6          3.1
4             5.0          3.6
..            ...          ...
145           6.7          3.0
146           6.3          2.5
147           6.5          3.0
148           6.2          3.4
149           5.9          3.0

[150 rows x 2 columns]

In [42]:
type(df1[["sepal_length","sepal_width"]]) # this has two columns so it is 2d and 2d is data frame

pandas.core.frame.DataFrame

In [43]:
df1.iloc[0] # gives 1st row

sepal_length       5.1
sepal_width        3.5
petal_length       1.4
petal_width        0.2
species         setosa
Name: 0, dtype: object

In [45]:
type(df1.iloc[0]) # it is a row and a row is also 1d so a series

pandas.core.series.Series

In [47]:
df1.iloc[0]

sepal_length       5.1
sepal_width        3.5
petal_length       1.4
petal_width        0.2
species         setosa
Name: 0, dtype: object

In [48]:
df2=pd.read_csv('data/iris_deleted.csv')

In [52]:
df2.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           NaN          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

it contains some empty cells which is Nan so we can use dropna() to drop those rows with missing data

In [53]:
df2.dropna()

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
5             5.4          3.9           1.7          0.4     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[142 rows x 5 columns]

In [55]:
df2.fillna(0)
# df2.fillna(0, inplace=True)
#inplace=True will modify the original data frame

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           0.0          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

## changing column name

In [57]:
df2.rename(columns={'sepal_length':'sl'}) # not modifes the orignal gives new like every other

      sl  sepal_width  petal_length  petal_width    species
0    5.1          3.5           1.4          0.2     setosa
1    4.9          3.0           1.4          0.2     setosa
2    4.7          3.2           1.3          0.2     setosa
3    4.6          3.1           NaN          0.2     setosa
4    5.0          3.6           1.4          0.2     setosa
..   ...          ...           ...          ...        ...
145  6.7          3.0           5.2          2.3  virginica
146  6.3          2.5           5.0          1.9  virginica
147  6.5          3.0           5.2          2.0  virginica
148  6.2          3.4           5.4          2.3  virginica
149  5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

#### pandas automatically detect data types but we can change them if we want

In [58]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   sepal_length  150 non-null    float64
 1   sepal_width   146 non-null    float64
 2   petal_length  146 non-null    float64
 3   petal_width   149 non-null    float64
 4   species       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB

In [61]:
df2["sl_extra"] = df2["sepal_length"].astype(int) # i did not wanted to change the same columnd data so created a new if change data use same column name both side

In [60]:
df2

     sepal_length  sepal_width  petal_length  petal_width    species  sl_extra
0             5.1          3.5           1.4          0.2     setosa         5
1             4.9          3.0           1.4          0.2     setosa         4
2             4.7          3.2           1.3          0.2     setosa         4
3             4.6          3.1           NaN          0.2     setosa         4
4             5.0          3.6           1.4          0.2     setosa         5
..            ...          ...           ...          ...        ...       ...
145           6.7          3.0           5.2          2.3  virginica         6
146           6.3          2.5           5.0          1.9  virginica         6
147           6.5          3.0           5.2          2.0  virginica         6
148           6.2          3.4           5.4          2.3  virginica         6
149           5.9          3.0           5.1          1.8  virginica         5

[150 rows x 6 columns]

In [63]:
df2["sl_extra"]= df2["sepal_length"].astype(str)

In [65]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   sepal_length  150 non-null    float64
 1   sepal_width   146 non-null    float64
 2   petal_length  146 non-null    float64
 3   petal_width   149 non-null    float64
 4   species       150 non-null    object
 5   sl_extra      150 non-null    object
dtypes: float64(4), object(2)
memory usage: 7.2+ KB

In [67]:
df2["sl_extra"][0]

'5.1'

data type is shown as object because before pandas 1 verion it used to store everything except number as object but now if we want we can use it as .astype("string")

In [68]:
df2["sl_extra"]= df2["sepal_length"].astype("string")

In [69]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   sepal_length  150 non-null    float64
 1   sepal_width   146 non-null    float64
 2   petal_length  146 non-null    float64
 3   petal_width   149 non-null    float64
 4   species       150 non-null    object
 5   sl_extra      150 non-null    string
dtypes: float64(4), object(1), string(1)
memory usage: 7.2+ KB

In [70]:
len(df2) # tells no of rows

150

In [73]:
df2["zero"]=[0 for i in range(len(df2))] # create a row with zeros

In [86]:
def incremetnByOne(a):
    return  a+1

df2["zeros +1"]= df2["zero"].apply(incremetnByOne) #add a column name as zero +1  and get the values from zero and incerement it by 1 and same to that new column

In [87]:
df2.head()

,sepal_length,sepal_width,petal_length,petal_width,species,sl_extra,zero,zeros +1,squared_petal_length
0,5.1,3.5,1.4,0.2,setosa,5.1,0,1,1.96
1,4.9,3.0,1.4,0.2,setosa,4.9,0,1,1.96
2,4.7,3.2,1.3,0.2,setosa,4.7,0,1,1.69
3,4.6,3.1,NaN,0.2,setosa,4.6,0,1,NaN
4,5.0,3.6,1.4,0.2,setosa,5.0,0,1,1.96

In [81]:
# squaring and saving value of petal length of that row and column in new column in same row
# say for row 0 value of petal length will be squared and saved in column squared_petal_length in same row

In [88]:
def square(x):
    return x*x
df2["squared_petal_length"]=df2["petal_length"].apply(square)

In [89]:
df2.head()

,sepal_length,sepal_width,petal_length,petal_width,species,sl_extra,zero,zeros +1,squared_petal_length
0,5.1,3.5,1.4,0.2,setosa,5.1,0,1,1.96
1,4.9,3.0,1.4,0.2,setosa,4.9,0,1,1.96
2,4.7,3.2,1.3,0.2,setosa,4.7,0,1,1.69
3,4.6,3.1,NaN,0.2,setosa,4.6,0,1,NaN
4,5.0,3.6,1.4,0.2,setosa,5.0,0,1,1.96

## to save as excel

In [90]:
df2.to_csv('data/iris_squared_indexed.csv') # will new column of index so use index=False

In [91]:
df2.to_csv('data/iris_squared_non_indexed.csv',index=False)

## merge two data frames as 1

In [93]:
df3=pd.DataFrame({
    "name":["sahil","mohit"],
    "age":[22,20]
})

df4=pd.DataFrame({
    "name":["ankit","ashish"],
    "age":[23,21]
})

In [95]:
df3

    name  age
0  sahil   22
1  mohit   20

In [96]:
df4

     name  age
0   ankit   23
1  ashish   21

In [97]:
pd.concat([df3,df4]) # merges them as 1 but their index remains same as it was in single data frame

     name  age
0   sahil   22
1   mohit   20
0   ankit   23
1  ashish   21

In [100]:
df5=pd.DataFrame({
    "name":["ankit","ashish","sd"],
    "rollno":[21,45,21]
})

In [101]:
pd.merge(df5,df4,on="name") # merged name and age wise

     name  rollno  age
0   ankit      21   23
1  ashish      45   21

```suppose sd was not in previous data set so not merged . we were using on param on name. so if any name present only in 1 data frame will be left```